<a href="https://colab.research.google.com/github/BragatteMAS/Python/blob/master/How_to/How_to_Convert_Dtypes_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# [**Convert Dtypes Pandas**](https://github.com/Guiih13/Dicas_Python/blob/main/01_Convertendo_Colunas/Convert_dtypes.ipynb)
 


1. Import lib
2. Create DataFrame
3. Verify Dtypes
4. **Convert Dtypes**
5. Check Dtypes corrections

by Bragatte 202102261808

In [2]:
import pandas as pd

In [6]:
name   = pd.Series(['Homer','Marge','Bart','Lisa','Maggie','Abe','Selma', 'Otto', 'Krusty'])
hair = pd.Series([0,25.4,5.08,15.24,10.16,2.54,20.32,25.4,15.24], dtype='object')
age = pd.Series([36,34,9,7,1,70,40,37,44], dtype='object')
Registered = pd.Series([True, True, True, True, False, False, False, False, False], dtype='object')

df = pd.DataFrame({
    'name':name,
    'hair':hair,
    'age':age,
    'Registered':Registered
})

In [7]:
df.head()

     name   hair age Registered
0   Homer      0  36       True
1   Marge   25.4  34       True
2    Bart   5.08   9       True
3    Lisa  15.24   7       True
4  Maggie  10.16   1      False

In [8]:
df.dtypes

name          object
hair          object
age           object
Registered    object
dtype: object

In [9]:
new_df = df.convert_dtypes(convert_boolean=False)

In [10]:
new_df.head()

     name   hair  age  Registered
0   Homer   0.00   36           1
1   Marge  25.40   34           1
2    Bart   5.08    9           1
3    Lisa  15.24    7           1
4  Maggie  10.16    1           0

In [11]:
new_df.dtypes

name           string
hair          float64
age             Int64
Registered      Int64
dtype: object